# Pandas

In [4]:
import pandas as pd
import numpy as np

### Playing with dataframe

In [8]:
df = pd.DataFrame(np.arange(0,20).reshape(5,4), index=['Row1','Row2','Row3','Row4','Row5'], columns=['col1','col2','col3','col4'])
df

      col1  col2  col3  col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [9]:
#Accessing Elements
df.loc['Row1']

col1    0
col2    1
col3    2
col4    3
Name: Row1, dtype: int32

In [10]:
type(df.loc['Row1'])

pandas.core.series.Series

In [11]:
df.iloc[:,:]

      col1  col2  col3  col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [12]:
df.iloc[:,1:]

      col2  col3  col4
Row1     1     2     3
Row2     5     6     7
Row3     9    10    11
Row4    13    14    15
Row5    17    18    19

In [13]:
#Converting Dataframe into array
df.values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [14]:
lst = [[1,2,3],[3,4,np.nan],[4,5,np.nan],[np.nan,np.nan,np.nan]]
df = pd.DataFrame(lst)

In [15]:
df

     0    1    2
0  1.0  2.0  3.0
1  3.0  4.0  NaN
2  4.0  5.0  NaN
3  NaN  NaN  NaN

### Handling missing values

In [18]:
df = pd.DataFrame(np.random.randn(5,3), index=['a','c','e','f','h'], columns=['one','two','three'])

In [19]:
df

        one       two     three
a -0.870054  1.064630  0.037491
c  1.309883 -0.326490 -0.802223
e  0.386593  1.900354 -0.811596
f -0.007582 -0.446503 -2.123514
h  1.120785 -2.541725 -0.477228

In [20]:
df = df.reindex(['a','b','c','d','e','f','g','h'])
df

        one       two     three
a -0.870054  1.064630  0.037491
b       NaN       NaN       NaN
c  1.309883 -0.326490 -0.802223
d       NaN       NaN       NaN
e  0.386593  1.900354 -0.811596
f -0.007582 -0.446503 -2.123514
g       NaN       NaN       NaN
h  1.120785 -2.541725 -0.477228

In [21]:
df.dropna(axis=0)

        one       two     three
a -0.870054  1.064630  0.037491
c  1.309883 -0.326490 -0.802223
e  0.386593  1.900354 -0.811596
f -0.007582 -0.446503 -2.123514
h  1.120785 -2.541725 -0.477228

In [22]:
pd.isna(df['one'])

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [23]:
df['one'].notna()

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

In [24]:
df.fillna('Missing')

          one       two     three
a   -0.870054   1.06463  0.037491
b     Missing   Missing   Missing
c     1.30988  -0.32649 -0.802223
d     Missing   Missing   Missing
e    0.386593   1.90035 -0.811596
f -0.00758204 -0.446503  -2.12351
g     Missing   Missing   Missing
h     1.12078  -2.54172 -0.477228